STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231cxx_ca35.h
/*****************  Bit definition for DTS_PVT_IER register  ******************/
#define DTS_PVT_IER_TMR_IRQ_ENABLE_Pos              (0U)
#define DTS_PVT_IER_TMR_IRQ_ENABLE_Msk              (0x1UL << DTS_PVT_IER_TMR_IRQ_ENABLE_Pos)             /*!< 0x00000001 */
#define DTS_PVT_IER_TMR_IRQ_ENABLE                  DTS_PVT_IER_TMR_IRQ_ENABLE_Msk                       /*!< Timer IRQ source enable bit */
#define DTS_PVT_IER_TS_IRQ_ENABLE_Pos               (1U)
#define DTS_PVT_IER_TS_IRQ_ENABLE_Msk               (0x1UL << DTS_PVT_IER_TS_IRQ_ENABLE_Pos)              /*!< 0x00000002 */
#define DTS_PVT_IER_TS_IRQ_ENABLE                   DTS_PVT_IER_TS_IRQ_ENABLE_Msk                        /*!< TS IRQ source enable bit */

/**************  Bit definition for DTS_PVTIRQTRMASKR register  ***************/
#define DTS_PVTIRQTRMASKR_TMR_IRQ_MASK_Pos          (0U)
#define DTS_PVTIRQTRMASKR_TMR_IRQ_MASK_Msk          (0x1UL << DTS_PVTIRQTRMASKR_TMR_IRQ_MASK_Pos)         /*!< 0x00000001 */
#define DTS_PVTIRQTRMASKR_TMR_IRQ_MASK              DTS_PVTIRQTRMASKR_TMR_IRQ_MASK_Msk                   /*!< Timer IRQ source mask bit */

/******************  Bit definition for DTS_TS_MR register  *******************/
#define DTS_TS_MR_TS0_IRQ_MASK_Pos                  (0U)
#define DTS_TS_MR_TS0_IRQ_MASK_Msk                  (0x1UL << DTS_TS_MR_TS0_IRQ_MASK_Pos)                 /*!< 0x00000001 */
#define DTS_TS_MR_TS0_IRQ_MASK                      DTS_TS_MR_TS0_IRQ_MASK_Msk                           /*!< TS0 IRQ source mask bit */
#define DTS_TS_MR_TS1_IRQ_MASK_Pos                  (1U)
#define DTS_TS_MR_TS1_IRQ_MASK_Msk                  (0x1UL << DTS_TS_MR_TS1_IRQ_MASK_Pos)                 /*!< 0x00000002 */
#define DTS_TS_MR_TS1_IRQ_MASK                      DTS_TS_MR_TS1_IRQ_MASK_Msk                           /*!< TS1 IRQ source mask bit */

/*****************  Bit definition for DTS_PVTTR_SR register  *****************/
#define DTS_PVTTR_SR_TMR_IRQ_STATUS_Pos             (0U)
#define DTS_PVTTR_SR_TMR_IRQ_STATUS_Msk             (0x1UL << DTS_PVTTR_SR_TMR_IRQ_STATUS_Pos)            /*!< 0x00000001 */
#define DTS_PVTTR_SR_TMR_IRQ_STATUS                 DTS_PVTTR_SR_TMR_IRQ_STATUS_Msk                      /*!< Timer IRQ status bit after masking */

/******************  Bit definition for DTS_TS_ISR register  ******************/
#define DTS_TS_ISR_TS0_IRQ_STATUS_Pos               (0U)
#define DTS_TS_ISR_TS0_IRQ_STATUS_Msk               (0x1UL << DTS_TS_ISR_TS0_IRQ_STATUS_Pos)              /*!< 0x00000001 */
#define DTS_TS_ISR_TS0_IRQ_STATUS                   DTS_TS_ISR_TS0_IRQ_STATUS_Msk                        /*!< TS0 IRQ status bit after masking */
#define DTS_TS_ISR_TS1_IRQ_STATUS_Pos               (1U)
#define DTS_TS_ISR_TS1_IRQ_STATUS_Msk               (0x1UL << DTS_TS_ISR_TS1_IRQ_STATUS_Pos)              /*!< 0x00000002 */
#define DTS_TS_ISR_TS1_IRQ_STATUS                   DTS_TS_ISR_TS1_IRQ_STATUS_Msk                        /*!< TS1 IRQ status bit after masking */

/**************  Bit definition for DTS_PVTTMRRAW_ISR register  ***************/
#define DTS_PVTTMRRAW_ISR_TMR_IRQ_RAW_STATUS_Pos    (0U)
#define DTS_PVTTMRRAW_ISR_TMR_IRQ_RAW_STATUS_Msk    (0x1UL << DTS_PVTTMRRAW_ISR_TMR_IRQ_RAW_STATUS_Pos)   /*!< 0x00000001 */
#define DTS_PVTTMRRAW_ISR_TMR_IRQ_RAW_STATUS        DTS_PVTTMRRAW_ISR_TMR_IRQ_RAW_STATUS_Msk             /*!< TMR IRQ status bit before masking */

/****************  Bit definition for DTS_TSRAW_ISR register  *****************/
#define DTS_TSRAW_ISR_TS0_IRQ_RAW_STATUS_Pos        (0U)
#define DTS_TSRAW_ISR_TS0_IRQ_RAW_STATUS_Msk        (0x1UL << DTS_TSRAW_ISR_TS0_IRQ_RAW_STATUS_Pos)       /*!< 0x00000001 */
#define DTS_TSRAW_ISR_TS0_IRQ_RAW_STATUS            DTS_TSRAW_ISR_TS0_IRQ_RAW_STATUS_Msk                 /*!< TS0 IRQ status bit before masking */
#define DTS_TSRAW_ISR_TS1_IRQ_RAW_STATUS_Pos        (1U)
#define DTS_TSRAW_ISR_TS1_IRQ_RAW_STATUS_Msk        (0x1UL << DTS_TSRAW_ISR_TS1_IRQ_RAW_STATUS_Pos)       /*!< 0x00000002 */
#define DTS_TSRAW_ISR_TS1_IRQ_RAW_STATUS            DTS_TSRAW_ISR_TS1_IRQ_RAW_STATUS_Msk                 /*!< TS1 IRQ status bit before masking */

/***************  Bit definition for DTS_TSCCLKSYNTHR register  ***************/
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_LO_Pos           (0U)
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_LO_Msk           (0xFFUL << DTS_TSCCLKSYNTHR_CLK_SYNTH_LO_Pos)         /*!< 0x000000FF */
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_LO               DTS_TSCCLKSYNTHR_CLK_SYNTH_LO_Msk                    /*!< Synthesized clk_ts low period */
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_HI_Pos           (8U)
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_HI_Msk           (0xFFUL << DTS_TSCCLKSYNTHR_CLK_SYNTH_HI_Pos)         /*!< 0x0000FF00 */
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_HI               DTS_TSCCLKSYNTHR_CLK_SYNTH_HI_Msk                    /*!< Synthesized clk_ts high period */
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_HOLD_Pos         (16U)
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_HOLD_Msk         (0xFUL << DTS_TSCCLKSYNTHR_CLK_SYNTH_HOLD_Pos)        /*!< 0x000F0000 */
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_HOLD             DTS_TSCCLKSYNTHR_CLK_SYNTH_HOLD_Msk                  /*!< SDA master-to-SDA slave output hold delay/SDA slave-to-SDA master input setup delay */
#define DTS_TSCCLKSYNTHR_CLK_SYTH_EN_Pos            (24U)
#define DTS_TSCCLKSYNTHR_CLK_SYTH_EN_Msk            (0x1UL << DTS_TSCCLKSYNTHR_CLK_SYTH_EN_Pos)           /*!< 0x01000000 */
#define DTS_TSCCLKSYNTHR_CLK_SYTH_EN                DTS_TSCCLKSYNTHR_CLK_SYTH_EN_Msk                     /*!< Synthesized clk_ts enable bit */

/*************  Bit definition for DTS_TSCSDIFDISABLER register  **************/
#define DTS_TSCSDIFDISABLER_TS0_SDIF_DISABLE_Pos    (0U)
#define DTS_TSCSDIFDISABLER_TS0_SDIF_DISABLE_Msk    (0x1UL << DTS_TSCSDIFDISABLER_TS0_SDIF_DISABLE_Pos)   /*!< 0x00000001 */
#define DTS_TSCSDIFDISABLER_TS0_SDIF_DISABLE        DTS_TSCSDIFDISABLER_TS0_SDIF_DISABLE_Msk             /*!< TS0 serial data interface (SDIF) disable bit */
#define DTS_TSCSDIFDISABLER_TS1_SDIF_DISABLE_Pos    (1U)
#define DTS_TSCSDIFDISABLER_TS1_SDIF_DISABLE_Msk    (0x1UL << DTS_TSCSDIFDISABLER_TS1_SDIF_DISABLE_Pos)   /*!< 0x00000002 */
#define DTS_TSCSDIFDISABLER_TS1_SDIF_DISABLE        DTS_TSCSDIFDISABLER_TS1_SDIF_DISABLE_Msk             /*!< TS1 serial data interface (SDIF) disable bit */

