STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231cxx_ca35.h
/*****************  Bit definition for ETH_DMAC2CR register  ******************/
#define ETH_DMAC2CR_MSS_Pos                 (0U)
#define ETH_DMAC2CR_MSS_Msk                 (0x3FFFUL << ETH_DMAC2CR_MSS_Pos)                     /*!< 0x00003FFF */
#define ETH_DMAC2CR_MSS                     ETH_DMAC2CR_MSS_Msk                                 /*!< Maximum Segment Size */
#define ETH_DMAC2CR_PBLX8_Pos               (16U)
#define ETH_DMAC2CR_PBLX8_Msk               (0x1UL << ETH_DMAC2CR_PBLX8_Pos)                     /*!< 0x00010000 */
#define ETH_DMAC2CR_PBLX8                   ETH_DMAC2CR_PBLX8_Msk                               /*!< 8xPBL mode */
#define ETH_DMAC2CR_DSL_Pos                 (18U)
#define ETH_DMAC2CR_DSL_Msk                 (0x7UL << ETH_DMAC2CR_DSL_Pos)                        /*!< 0x001C0000 */
#define ETH_DMAC2CR_DSL                     ETH_DMAC2CR_DSL_Msk                                 /*!< Descriptor Skip Length */

/****************  Bit definition for ETH_DMAC2TXCR register  *****************/
#define ETH_DMAC2TXCR_ST_Pos                (0U)
#define ETH_DMAC2TXCR_ST_Msk                (0x1UL << ETH_DMAC2TXCR_ST_Pos)                      /*!< 0x00000001 */
#define ETH_DMAC2TXCR_ST                    ETH_DMAC2TXCR_ST_Msk                                /*!< Start or Stop Transmission Command */
#define ETH_DMAC2TXCR_TCW_Pos               (1U)
#define ETH_DMAC2TXCR_TCW_Msk               (0x7UL << ETH_DMAC2TXCR_TCW_Pos)                      /*!< 0x0000000E */
#define ETH_DMAC2TXCR_TCW                   ETH_DMAC2TXCR_TCW_Msk                               /*!< Transmit Channel Weight */
#define ETH_DMAC2TXCR_OSF_Pos               (4U)
#define ETH_DMAC2TXCR_OSF_Msk               (0x1UL << ETH_DMAC2TXCR_OSF_Pos)                     /*!< 0x00000010 */
#define ETH_DMAC2TXCR_OSF                   ETH_DMAC2TXCR_OSF_Msk                               /*!< Operate on Second Packet */
#define ETH_DMAC2TXCR_TSE_Pos               (12U)
#define ETH_DMAC2TXCR_TSE_Msk               (0x1UL << ETH_DMAC2TXCR_TSE_Pos)                     /*!< 0x00001000 */
#define ETH_DMAC2TXCR_TSE                   ETH_DMAC2TXCR_TSE_Msk                               /*!< TCP Segmentation Enabled */
#define ETH_DMAC2TXCR_IPBL_Pos              (15U)
#define ETH_DMAC2TXCR_IPBL_Msk              (0x1UL << ETH_DMAC2TXCR_IPBL_Pos)                    /*!< 0x00008000 */
#define ETH_DMAC2TXCR_IPBL                  ETH_DMAC2TXCR_IPBL_Msk                              /*!< Ignore PBL Requirement */
#define ETH_DMAC2TXCR_TXPBL_Pos             (16U)
#define ETH_DMAC2TXCR_TXPBL_Msk             (0x3FUL << ETH_DMAC2TXCR_TXPBL_Pos)                   /*!< 0x003F0000 */
#define ETH_DMAC2TXCR_TXPBL                 ETH_DMAC2TXCR_TXPBL_Msk                             /*!< Transmit Programmable Burst Length */
#define ETH_DMAC2TXCR_TQOS_Pos              (24U)
#define ETH_DMAC2TXCR_TQOS_Msk              (0xFUL << ETH_DMAC2TXCR_TQOS_Pos)                     /*!< 0x0F000000 */
#define ETH_DMAC2TXCR_TQOS                  ETH_DMAC2TXCR_TQOS_Msk                              /*!< Transmit QOS */
#define ETH_DMAC2TXCR_EDSE_Pos              (28U)
#define ETH_DMAC2TXCR_EDSE_Msk              (0x1UL << ETH_DMAC2TXCR_EDSE_Pos)                    /*!< 0x10000000 */
#define ETH_DMAC2TXCR_EDSE                  ETH_DMAC2TXCR_EDSE_Msk                              /*!< Enhanced Descriptor Enable */
#define ETH_DMAC2TXCR_TFSEL0_Pos            (29U)
#define ETH_DMAC2TXCR_TFSEL0_Msk            (0x1UL << ETH_DMAC2TXCR_TFSEL0_Pos)                  /*!< 0x20000000 */
#define ETH_DMAC2TXCR_TFSEL0                ETH_DMAC2TXCR_TFSEL0_Msk                            /*!< TBS Fetch Select */
#define ETH_DMAC2TXCR_TFSEL1_Pos            (30U)
#define ETH_DMAC2TXCR_TFSEL1_Msk            (0x1UL << ETH_DMAC2TXCR_TFSEL1_Pos)                  /*!< 0x40000000 */
#define ETH_DMAC2TXCR_TFSEL1                ETH_DMAC2TXCR_TFSEL1_Msk                            /*!< TBS Fetch Select */

/***************  Bit definition for ETH_DMAC2TXDLAR register  ****************/
#define ETH_DMAC2TXDLAR_TDESLA_Pos          (0U)
#define ETH_DMAC2TXDLAR_TDESLA_Msk          (0xFFFFFFFFUL << ETH_DMAC2TXDLAR_TDESLA_Pos)         /*!< 0xFFFFFFFF */
#define ETH_DMAC2TXDLAR_TDESLA              ETH_DMAC2TXDLAR_TDESLA_Msk                          /*!< Start of Transmit List */

/***************  Bit definition for ETH_DMAC2TXDTPR register  ****************/
#define ETH_DMAC2TXDTPR_TDT_Pos             (0U)
#define ETH_DMAC2TXDTPR_TDT_Msk             (0xFFFFFFFFUL << ETH_DMAC2TXDTPR_TDT_Pos)            /*!< 0xFFFFFFFF */
#define ETH_DMAC2TXDTPR_TDT                 ETH_DMAC2TXDTPR_TDT_Msk                             /*!< Transmit Descriptor Tail Pointer */

/****************  Bit definition for ETH_DMAC2TXRLR register  ****************/
#define ETH_DMAC2TXRLR_TDRL_Pos             (0U)
#define ETH_DMAC2TXRLR_TDRL_Msk             (0x3FFUL << ETH_DMAC2TXRLR_TDRL_Pos)                  /*!< 0x000003FF */
#define ETH_DMAC2TXRLR_TDRL                 ETH_DMAC2TXRLR_TDRL_Msk                             /*!< Transmit Descriptor Ring Length */

/*****************  Bit definition for ETH_DMAC2IER register  *****************/
#define ETH_DMAC2IER_TIE_Pos                (0U)
#define ETH_DMAC2IER_TIE_Msk                (0x1UL << ETH_DMAC2IER_TIE_Pos)                      /*!< 0x00000001 */
#define ETH_DMAC2IER_TIE                    ETH_DMAC2IER_TIE_Msk                                /*!< Transmit Interrupt Enable */
#define ETH_DMAC2IER_TXSE_Pos               (1U)
#define ETH_DMAC2IER_TXSE_Msk               (0x1UL << ETH_DMAC2IER_TXSE_Pos)                     /*!< 0x00000002 */
#define ETH_DMAC2IER_TXSE                   ETH_DMAC2IER_TXSE_Msk                               /*!< Transmit Stopped Enable */
#define ETH_DMAC2IER_TBUE_Pos               (2U)
#define ETH_DMAC2IER_TBUE_Msk               (0x1UL << ETH_DMAC2IER_TBUE_Pos)                     /*!< 0x00000004 */
#define ETH_DMAC2IER_TBUE                   ETH_DMAC2IER_TBUE_Msk                               /*!< Transmit Buffer Unavailable Enable */
#define ETH_DMAC2IER_RIE_Pos                (6U)
#define ETH_DMAC2IER_RIE_Msk                (0x1UL << ETH_DMAC2IER_RIE_Pos)                      /*!< 0x00000040 */
#define ETH_DMAC2IER_RIE                    ETH_DMAC2IER_RIE_Msk                                /*!< Receive Interrupt Enable */
#define ETH_DMAC2IER_RBUE_Pos               (7U)
#define ETH_DMAC2IER_RBUE_Msk               (0x1UL << ETH_DMAC2IER_RBUE_Pos)                     /*!< 0x00000080 */
#define ETH_DMAC2IER_RBUE                   ETH_DMAC2IER_RBUE_Msk                               /*!< Receive Buffer Unavailable Enable */
#define ETH_DMAC2IER_RSE_Pos                (8U)
#define ETH_DMAC2IER_RSE_Msk                (0x1UL << ETH_DMAC2IER_RSE_Pos)                      /*!< 0x00000100 */
#define ETH_DMAC2IER_RSE                    ETH_DMAC2IER_RSE_Msk                                /*!< Receive Stopped Enable */
#define ETH_DMAC2IER_RWTE_Pos               (9U)
#define ETH_DMAC2IER_RWTE_Msk               (0x1UL << ETH_DMAC2IER_RWTE_Pos)                     /*!< 0x00000200 */
#define ETH_DMAC2IER_RWTE                   ETH_DMAC2IER_RWTE_Msk                               /*!< Receive Watchdog Timeout Enable */
#define ETH_DMAC2IER_ETIE_Pos               (10U)
#define ETH_DMAC2IER_ETIE_Msk               (0x1UL << ETH_DMAC2IER_ETIE_Pos)                     /*!< 0x00000400 */
#define ETH_DMAC2IER_ETIE                   ETH_DMAC2IER_ETIE_Msk                               /*!< Early Transmit Interrupt Enable */
#define ETH_DMAC2IER_ERIE_Pos               (11U)
#define ETH_DMAC2IER_ERIE_Msk               (0x1UL << ETH_DMAC2IER_ERIE_Pos)                     /*!< 0x00000800 */
#define ETH_DMAC2IER_ERIE                   ETH_DMAC2IER_ERIE_Msk                               /*!< Early receive interrupt Enable */
#define ETH_DMAC2IER_FBEE_Pos               (12U)
#define ETH_DMAC2IER_FBEE_Msk               (0x1UL << ETH_DMAC2IER_FBEE_Pos)                     /*!< 0x00001000 */
#define ETH_DMAC2IER_FBEE                   ETH_DMAC2IER_FBEE_Msk                               /*!< Fatal Bus Error Enable */
#define ETH_DMAC2IER_CDEE_Pos               (13U)
#define ETH_DMAC2IER_CDEE_Msk               (0x1UL << ETH_DMAC2IER_CDEE_Pos)                     /*!< 0x00002000 */
#define ETH_DMAC2IER_CDEE                   ETH_DMAC2IER_CDEE_Msk                               /*!< Context Descriptor Error Enable */
#define ETH_DMAC2IER_AIE_Pos                (14U)
#define ETH_DMAC2IER_AIE_Msk                (0x1UL << ETH_DMAC2IER_AIE_Pos)                      /*!< 0x00004000 */
#define ETH_DMAC2IER_AIE                    ETH_DMAC2IER_AIE_Msk                                /*!< Abnormal Interrupt Summary Enable */
#define ETH_DMAC2IER_NIE_Pos                (15U)
#define ETH_DMAC2IER_NIE_Msk                (0x1UL << ETH_DMAC2IER_NIE_Pos)                      /*!< 0x00008000 */
#define ETH_DMAC2IER_NIE                    ETH_DMAC2IER_NIE_Msk                                /*!< Normal Interrupt Summary Enable */

/****************  Bit definition for ETH_DMAC2SFCSR register  ****************/
#define ETH_DMAC2SFCSR_ESC_Pos              (0U)
#define ETH_DMAC2SFCSR_ESC_Msk              (0x1UL << ETH_DMAC2SFCSR_ESC_Pos)                    /*!< 0x00000001 */
#define ETH_DMAC2SFCSR_ESC                  ETH_DMAC2SFCSR_ESC_Msk                              /*!< Enable Slot Comparison */
#define ETH_DMAC2SFCSR_ASC_Pos              (1U)
#define ETH_DMAC2SFCSR_ASC_Msk              (0x1UL << ETH_DMAC2SFCSR_ASC_Pos)                    /*!< 0x00000002 */
#define ETH_DMAC2SFCSR_ASC                  ETH_DMAC2SFCSR_ASC_Msk                              /*!< Advance Slot Check */
#define ETH_DMAC2SFCSR_SIV_Pos              (4U)
#define ETH_DMAC2SFCSR_SIV_Msk              (0xFFFUL << ETH_DMAC2SFCSR_SIV_Pos)                   /*!< 0x0000FFF0 */
#define ETH_DMAC2SFCSR_SIV                  ETH_DMAC2SFCSR_SIV_Msk                              /*!< Slot Interval Value */
#define ETH_DMAC2SFCSR_RSN_Pos              (16U)
#define ETH_DMAC2SFCSR_RSN_Msk              (0xFUL << ETH_DMAC2SFCSR_RSN_Pos)                     /*!< 0x000F0000 */
#define ETH_DMAC2SFCSR_RSN                  ETH_DMAC2SFCSR_RSN_Msk                              /*!< Reference Slot Number */

/***************  Bit definition for ETH_DMAC2CATXDR register  ****************/
#define ETH_DMAC2CATXDR_CURTDESAPTR_Pos     (0U)
#define ETH_DMAC2CATXDR_CURTDESAPTR_Msk     (0xFFFFFFFFUL << ETH_DMAC2CATXDR_CURTDESAPTR_Pos)    /*!< 0xFFFFFFFF */
#define ETH_DMAC2CATXDR_CURTDESAPTR         ETH_DMAC2CATXDR_CURTDESAPTR_Msk                     /*!< Application Transmit Descriptor Address Pointer */

/***************  Bit definition for ETH_DMAC2CATXBR register  ****************/
#define ETH_DMAC2CATXBR_CURTBUFAPTR_Pos     (0U)
#define ETH_DMAC2CATXBR_CURTBUFAPTR_Msk     (0xFFFFFFFFUL << ETH_DMAC2CATXBR_CURTBUFAPTR_Pos)    /*!< 0xFFFFFFFF */
#define ETH_DMAC2CATXBR_CURTBUFAPTR         ETH_DMAC2CATXBR_CURTBUFAPTR_Msk                     /*!< Application Transmit Buffer Address Pointer */

/*****************  Bit definition for ETH_DMAC2SR register  ******************/
#define ETH_DMAC2SR_TI_Pos                  (0U)
#define ETH_DMAC2SR_TI_Msk                  (0x1UL << ETH_DMAC2SR_TI_Pos)                        /*!< 0x00000001 */
#define ETH_DMAC2SR_TI                      ETH_DMAC2SR_TI_Msk                                  /*!< Transmit Interrupt */
#define ETH_DMAC2SR_TPS_Pos                 (1U)
#define ETH_DMAC2SR_TPS_Msk                 (0x1UL << ETH_DMAC2SR_TPS_Pos)                       /*!< 0x00000002 */
#define ETH_DMAC2SR_TPS                     ETH_DMAC2SR_TPS_Msk                                 /*!< Transmit Process Stopped */
#define ETH_DMAC2SR_TBU_Pos                 (2U)
#define ETH_DMAC2SR_TBU_Msk                 (0x1UL << ETH_DMAC2SR_TBU_Pos)                       /*!< 0x00000004 */
#define ETH_DMAC2SR_TBU                     ETH_DMAC2SR_TBU_Msk                                 /*!< Transmit Buffer Unavailable */
#define ETH_DMAC2SR_RI_Pos                  (6U)
#define ETH_DMAC2SR_RI_Msk                  (0x1UL << ETH_DMAC2SR_RI_Pos)                        /*!< 0x00000040 */
#define ETH_DMAC2SR_RI                      ETH_DMAC2SR_RI_Msk                                  /*!< Receive Interrupt */
#define ETH_DMAC2SR_RBU_Pos                 (7U)
#define ETH_DMAC2SR_RBU_Msk                 (0x1UL << ETH_DMAC2SR_RBU_Pos)                       /*!< 0x00000080 */
#define ETH_DMAC2SR_RBU                     ETH_DMAC2SR_RBU_Msk                                 /*!< Receive Buffer Unavailable */
#define ETH_DMAC2SR_RPS_Pos                 (8U)
#define ETH_DMAC2SR_RPS_Msk                 (0x1UL << ETH_DMAC2SR_RPS_Pos)                       /*!< 0x00000100 */
#define ETH_DMAC2SR_RPS                     ETH_DMAC2SR_RPS_Msk                                 /*!< Receive Process Stopped */
#define ETH_DMAC2SR_RWT_Pos                 (9U)
#define ETH_DMAC2SR_RWT_Msk                 (0x1UL << ETH_DMAC2SR_RWT_Pos)                       /*!< 0x00000200 */
#define ETH_DMAC2SR_RWT                     ETH_DMAC2SR_RWT_Msk                                 /*!< Receive Watchdog Timeout */
#define ETH_DMAC2SR_ETI_Pos                 (10U)
#define ETH_DMAC2SR_ETI_Msk                 (0x1UL << ETH_DMAC2SR_ETI_Pos)                       /*!< 0x00000400 */
#define ETH_DMAC2SR_ETI                     ETH_DMAC2SR_ETI_Msk                                 /*!< Early Transmit Interrupt */
#define ETH_DMAC2SR_ERI_Pos                 (11U)
#define ETH_DMAC2SR_ERI_Msk                 (0x1UL << ETH_DMAC2SR_ERI_Pos)                       /*!< 0x00000800 */
#define ETH_DMAC2SR_ERI                     ETH_DMAC2SR_ERI_Msk                                 /*!< Early Receive Interrupt */
#define ETH_DMAC2SR_FBE_Pos                 (12U)
#define ETH_DMAC2SR_FBE_Msk                 (0x1UL << ETH_DMAC2SR_FBE_Pos)                       /*!< 0x00001000 */
#define ETH_DMAC2SR_FBE                     ETH_DMAC2SR_FBE_Msk                                 /*!< Fatal Bus Error */
#define ETH_DMAC2SR_CDE_Pos                 (13U)
#define ETH_DMAC2SR_CDE_Msk                 (0x1UL << ETH_DMAC2SR_CDE_Pos)                       /*!< 0x00002000 */
#define ETH_DMAC2SR_CDE                     ETH_DMAC2SR_CDE_Msk                                 /*!< Context Descriptor Error */
#define ETH_DMAC2SR_AIS_Pos                 (14U)
#define ETH_DMAC2SR_AIS_Msk                 (0x1UL << ETH_DMAC2SR_AIS_Pos)                       /*!< 0x00004000 */
#define ETH_DMAC2SR_AIS                     ETH_DMAC2SR_AIS_Msk                                 /*!< Abnormal Interrupt Summary */
#define ETH_DMAC2SR_NIS_Pos                 (15U)
#define ETH_DMAC2SR_NIS_Msk                 (0x1UL << ETH_DMAC2SR_NIS_Pos)                       /*!< 0x00008000 */
#define ETH_DMAC2SR_NIS                     ETH_DMAC2SR_NIS_Msk                                 /*!< Normal Interrupt Summary */
#define ETH_DMAC2SR_TEB_Pos                 (16U)
#define ETH_DMAC2SR_TEB_Msk                 (0x7UL << ETH_DMAC2SR_TEB_Pos)                        /*!< 0x00070000 */
#define ETH_DMAC2SR_TEB                     ETH_DMAC2SR_TEB_Msk                                 /*!< Tx DMA Error Bits */
#define ETH_DMAC2SR_REB_Pos                 (19U)
#define ETH_DMAC2SR_REB_Msk                 (0x7UL << ETH_DMAC2SR_REB_Pos)                        /*!< 0x00380000 */
#define ETH_DMAC2SR_REB                     ETH_DMAC2SR_REB_Msk                                 /*!< Rx DMA Error Bits */

/*****************  Bit definition for ETH_DMAC3CR register  ******************/
#define ETH_DMAC3CR_MSS_Pos                 (0U)
#define ETH_DMAC3CR_MSS_Msk                 (0x3FFFUL << ETH_DMAC3CR_MSS_Pos)                     /*!< 0x00003FFF */
#define ETH_DMAC3CR_MSS                     ETH_DMAC3CR_MSS_Msk                                 /*!< Maximum Segment Size */
#define ETH_DMAC3CR_PBLX8_Pos               (16U)
#define ETH_DMAC3CR_PBLX8_Msk               (0x1UL << ETH_DMAC3CR_PBLX8_Pos)                     /*!< 0x00010000 */
#define ETH_DMAC3CR_PBLX8                   ETH_DMAC3CR_PBLX8_Msk                               /*!< 8xPBL mode */
#define ETH_DMAC3CR_DSL_Pos                 (18U)
#define ETH_DMAC3CR_DSL_Msk                 (0x7UL << ETH_DMAC3CR_DSL_Pos)                        /*!< 0x001C0000 */
#define ETH_DMAC3CR_DSL                     ETH_DMAC3CR_DSL_Msk                                 /*!< Descriptor Skip Length */

/****************  Bit definition for ETH_DMAC3TXCR register  *****************/
#define ETH_DMAC3TXCR_ST_Pos                (0U)
#define ETH_DMAC3TXCR_ST_Msk                (0x1UL << ETH_DMAC3TXCR_ST_Pos)                      /*!< 0x00000001 */
#define ETH_DMAC3TXCR_ST                    ETH_DMAC3TXCR_ST_Msk                                /*!< Start or Stop Transmission Command */
#define ETH_DMAC3TXCR_TCW_Pos               (1U)
#define ETH_DMAC3TXCR_TCW_Msk               (0x7UL << ETH_DMAC3TXCR_TCW_Pos)                      /*!< 0x0000000E */
#define ETH_DMAC3TXCR_TCW                   ETH_DMAC3TXCR_TCW_Msk                               /*!< Transmit Channel Weight */
#define ETH_DMAC3TXCR_OSF_Pos               (4U)
#define ETH_DMAC3TXCR_OSF_Msk               (0x1UL << ETH_DMAC3TXCR_OSF_Pos)                     /*!< 0x00000010 */
#define ETH_DMAC3TXCR_OSF                   ETH_DMAC3TXCR_OSF_Msk                               /*!< Operate on Second Packet */
#define ETH_DMAC3TXCR_TSE_Pos               (12U)
#define ETH_DMAC3TXCR_TSE_Msk               (0x1UL << ETH_DMAC3TXCR_TSE_Pos)                     /*!< 0x00001000 */
#define ETH_DMAC3TXCR_TSE                   ETH_DMAC3TXCR_TSE_Msk                               /*!< TCP Segmentation Enabled */
#define ETH_DMAC3TXCR_IPBL_Pos              (15U)
#define ETH_DMAC3TXCR_IPBL_Msk              (0x1UL << ETH_DMAC3TXCR_IPBL_Pos)                    /*!< 0x00008000 */
#define ETH_DMAC3TXCR_IPBL                  ETH_DMAC3TXCR_IPBL_Msk                              /*!< Ignore PBL Requirement */
#define ETH_DMAC3TXCR_TXPBL_Pos             (16U)
#define ETH_DMAC3TXCR_TXPBL_Msk             (0x3FUL << ETH_DMAC3TXCR_TXPBL_Pos)                   /*!< 0x003F0000 */
#define ETH_DMAC3TXCR_TXPBL                 ETH_DMAC3TXCR_TXPBL_Msk                             /*!< Transmit Programmable Burst Length */
#define ETH_DMAC3TXCR_TQOS_Pos              (24U)
#define ETH_DMAC3TXCR_TQOS_Msk              (0xFUL << ETH_DMAC3TXCR_TQOS_Pos)                     /*!< 0x0F000000 */
#define ETH_DMAC3TXCR_TQOS                  ETH_DMAC3TXCR_TQOS_Msk                              /*!< Transmit QOS */
#define ETH_DMAC3TXCR_EDSE_Pos              (28U)
#define ETH_DMAC3TXCR_EDSE_Msk              (0x1UL << ETH_DMAC3TXCR_EDSE_Pos)                    /*!< 0x10000000 */
#define ETH_DMAC3TXCR_EDSE                  ETH_DMAC3TXCR_EDSE_Msk                              /*!< Enhanced Descriptor Enable */
#define ETH_DMAC3TXCR_TFSEL0_Pos            (29U)
#define ETH_DMAC3TXCR_TFSEL0_Msk            (0x1UL << ETH_DMAC3TXCR_TFSEL0_Pos)                  /*!< 0x20000000 */
#define ETH_DMAC3TXCR_TFSEL0                ETH_DMAC3TXCR_TFSEL0_Msk                            /*!< TBS Fetch Select */
#define ETH_DMAC3TXCR_TFSEL1_Pos            (30U)
#define ETH_DMAC3TXCR_TFSEL1_Msk            (0x1UL << ETH_DMAC3TXCR_TFSEL1_Pos)                  /*!< 0x40000000 */
#define ETH_DMAC3TXCR_TFSEL1                ETH_DMAC3TXCR_TFSEL1_Msk                            /*!< TBS Fetch Select */

/***************  Bit definition for ETH_DMAC3TXDLAR register  ****************/
#define ETH_DMAC3TXDLAR_TDESLA_Pos          (0U)
#define ETH_DMAC3TXDLAR_TDESLA_Msk          (0xFFFFFFFFUL << ETH_DMAC3TXDLAR_TDESLA_Pos)         /*!< 0xFFFFFFFF */
#define ETH_DMAC3TXDLAR_TDESLA              ETH_DMAC3TXDLAR_TDESLA_Msk                          /*!< Start of Transmit List */

/***************  Bit definition for ETH_DMAC3TXDTPR register  ****************/
#define ETH_DMAC3TXDTPR_TDT_Pos             (0U)
#define ETH_DMAC3TXDTPR_TDT_Msk             (0xFFFFFFFFUL << ETH_DMAC3TXDTPR_TDT_Pos)            /*!< 0xFFFFFFFF */
#define ETH_DMAC3TXDTPR_TDT                 ETH_DMAC3TXDTPR_TDT_Msk                             /*!< Transmit Descriptor Tail Pointer */

/****************  Bit definition for ETH_DMAC3TXRLR register  ****************/
#define ETH_DMAC3TXRLR_TDRL_Pos             (0U)
#define ETH_DMAC3TXRLR_TDRL_Msk             (0x3FFUL << ETH_DMAC3TXRLR_TDRL_Pos)                  /*!< 0x000003FF */
#define ETH_DMAC3TXRLR_TDRL                 ETH_DMAC3TXRLR_TDRL_Msk                             /*!< Transmit Descriptor Ring Length */

