STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231cxx_ca35.h
/*******************  Bits definition for TAMP_COUNT2R register  **************/
#define TAMP_COUNT2R_Pos              (0U)
#define TAMP_COUNT2R_Msk              (0xFFFFFFFFUL << TAMP_COUNT2R_Pos)               /*!< 0xFFFFFFFFU */
#define TAMP_COUNT2R                  TAMP_COUNT2R_Msk

/*******************  Bits definition for TAMP_OR register  **************/
#define TAMP_IN1_RMP_Pos              (0U)
#define TAMP_IN1_RMP_Msk              (0x1UL << TAMP_IN1_RMP_Pos)                       /*!< 0x1U */
#define TAMP_IN1_RMP                  TAMP_IN1_RMP_Msk
#define TAMP_IN3_RMP_Pos              (1U)
#define TAMP_IN3_RMP_Msk              (0x1UL << TAMP_IN3_RMP_Pos)                       /*!< 0x2U */
#define TAMP_IN3_RMP                  TAMP_IN3_RMP_Msk
#define TAMP_IN5_RMP_Pos              (2U)
#define TAMP_IN5_RMP_Msk              (0x1UL << TAMP_IN5_RMP_Pos)                       /*!< 0x4U */
#define TAMP_IN5_RMP                  TAMP_IN5_RMP_Msk
#define TAMP_BSDIS_Pos                (3U)
#define TAMP_BSDIS_Msk                (0x1UL << TAMP_BSDIS_Pos)                         /*!< 0x8U */
#define TAMP_BSDIS                    TAMP_BSDIS_Msk

/*******************  Bits definition for TAMP_ERCFGR register  **************/
#define TAMP_ERCFG0_Pos               (0U)
#define TAMP_ERCFG0_Msk               (0x1UL << TAMP_ERCFG0_Pos)                        /*!< 0x1U */
#define TAMP_ERCFG0                   TAMP_ERCFG0_Msk

/*******************  Bits definition for TAMP_BKPRIFR1 register  *************/
#define TAMP_BKPRIFR1_BKPRWRIF_Pos    (0U)
#define TAMP_BKPRIFR1_BKPRWRIF_Msk    (0xFFUL << TAMP_BKPRIFR1_BKPRWRIF_Pos)            /*!< 0x000000FFU */
#define TAMP_BKPRIFR1_BKPRWRIF        TAMP_BKPRIFR1_BKPRWRIF_Msk

/*******************  Bits definition for TAMP_BKPRIFR2 register  *************/
#define TAMP_BKPRIFR2_BKPRWRIF_Pos    (0U)
#define TAMP_BKPRIFR2_BKPRWRIF_Msk    (0xFFUL << TAMP_BKPRIFR2_BKPRWRIF_Pos)            /*!< 0x000000FFU */
#define TAMP_BKPRIFR2_BKPRWRIF        TAMP_BKPRIFR2_BKPRWRIF_Msk

/*******************  Bits definition for TAMP_BKPRIFR3 register  *************/
#define TAMP_BKPRIFR3_BKPRWRIF1_Pos   (0U)
#define TAMP_BKPRIFR3_BKPRWRIF1_Msk   (0xFFUL << TAMP_BKPRIFR3_BKPRWRIF1_Pos)            /*!< 0x000000FFU */
#define TAMP_BKPRIFR3_BKPRWRIF1       TAMP_BKPRIFR3_BKPRWRIF1_Msk
#define TAMP_BKPRIFR3_BKPRWRIF2_Pos   (16U)
#define TAMP_BKPRIFR3_BKPRWRIF2_Msk   (0xFFUL << TAMP_BKPRIFR3_BKPRWRIF2_Pos)            /*!< 0x00FF0000U */
#define TAMP_BKPRIFR3_BKPRWRIF2       TAMP_BKPRIFR3_BKPRWRIF2_Msk

/*******************  Bits definition for TAMP_RCIDCFGR register  *************/
#define TAMP_RCIDCFGR_CFEN_Pos       (0U)
#define TAMP_RCIDCFGR_CFEN_Msk       (0x1UL << TAMP_RCIDCFGR_CFEN_Pos)                   /*!< 0x00000001U */
#define TAMP_RCIDCFGR_CFEN           TAMP_RCIDCFGR_CFEN_Msk
#define TAMP_RCIDCFGR_CID_Pos       (4U)
#define TAMP_RCIDCFGR_CID_Msk       (0xFUL << TAMP_RCIDCFGR_CID_Pos)                     /*!< 0x000000F0U */
#define TAMP_RCIDCFGR_CID           TAMP_RCIDCFGR_CID_Msk

/********************  Bits definition for TAMP_BKP0R register  ***************/
#define TAMP_BKP0R_Pos               (0U)
#define TAMP_BKP0R_Msk               (0xFFFFFFFFUL << TAMP_BKP0R_Pos)                   /*!< 0xFFFFFFFFU */
#define TAMP_BKP0R                   TAMP_BKP0R_Msk

/********************  Bits definition for TAMP_BKP1R register  ****************/
#define TAMP_BKP1R_Pos               (0U)
#define TAMP_BKP1R_Msk               (0xFFFFFFFFUL << TAMP_BKP1R_Pos)                   /*!< 0xFFFFFFFFU */
#define TAMP_BKP1R                   TAMP_BKP1R_Msk

/********************  Bits definition for TAMP_BKP2R register  ****************/
#define TAMP_BKP2R_Pos               (0U)
#define TAMP_BKP2R_Msk               (0xFFFFFFFFUL << TAMP_BKP2R_Pos)                   /*!< 0xFFFFFFFFU */
#define TAMP_BKP2R                   TAMP_BKP2R_Msk

/********************  Bits definition for TAMP_BKP3R register  ****************/
#define TAMP_BKP3R_Pos               (0U)
#define TAMP_BKP3R_Msk               (0xFFFFFFFFUL << TAMP_BKP3R_Pos)                   /*!< 0xFFFFFFFFU */
#define TAMP_BKP3R                   TAMP_BKP3R_Msk

/********************  Bits definition for TAMP_BKP4R register  ****************/
#define TAMP_BKP4R_Pos               (0U)
#define TAMP_BKP4R_Msk               (0xFFFFFFFFUL << TAMP_BKP4R_Pos)                   /*!< 0xFFFFFFFFU */
#define TAMP_BKP4R                   TAMP_BKP4R_Msk

/********************  Bits definition for TAMP_BKP5R register  ****************/
#define TAMP_BKP5R_Pos               (0U)
#define TAMP_BKP5R_Msk               (0xFFFFFFFFUL << TAMP_BKP5R_Pos)                   /*!< 0xFFFFFFFFU */
#define TAMP_BKP5R                   TAMP_BKP5R_Msk

/********************  Bits definition for TAMP_BKP6R register  ****************/
#define TAMP_BKP6R_Pos               (0U)
#define TAMP_BKP6R_Msk               (0xFFFFFFFFUL << TAMP_BKP6R_Pos)                   /*!< 0xFFFFFFFFU */
#define TAMP_BKP6R                   TAMP_BKP6R_Msk

/********************  Bits definition for TAMP_BKP7R register  ****************/
#define TAMP_BKP7R_Pos               (0U)
#define TAMP_BKP7R_Msk               (0xFFFFFFFFUL << TAMP_BKP7R_Pos)                   /*!< 0xFFFFFFFFU */
#define TAMP_BKP7R                   TAMP_BKP7R_Msk

/********************  Bits definition for TAMP_BKP8R register  ****************/
#define TAMP_BKP8R_Pos               (0U)
#define TAMP_BKP8R_Msk               (0xFFFFFFFFUL << TAMP_BKP8R_Pos)                   /*!< 0xFFFFFFFFU */
#define TAMP_BKP8R                   TAMP_BKP8R_Msk

/********************  Bits definition for TAMP_BKP9R register  ****************/
#define TAMP_BKP9R_Pos               (0U)
#define TAMP_BKP9R_Msk               (0xFFFFFFFFUL << TAMP_BKP9R_Pos)                   /*!< 0xFFFFFFFFU */
#define TAMP_BKP9R                   TAMP_BKP9R_Msk

/********************  Bits definition for TAMP_BKP10R register  ***************/
#define TAMP_BKP10R_Pos              (0U)
#define TAMP_BKP10R_Msk              (0xFFFFFFFFUL << TAMP_BKP10R_Pos)                  /*!< 0xFFFFFFFFU */
#define TAMP_BKP10R                  TAMP_BKP10R_Msk

/********************  Bits definition for TAMP_BKP11R register  ***************/
#define TAMP_BKP11R_Pos              (0U)
#define TAMP_BKP11R_Msk              (0xFFFFFFFFUL << TAMP_BKP11R_Pos)                  /*!< 0xFFFFFFFFU */
#define TAMP_BKP11R                  TAMP_BKP11R_Msk

/********************  Bits definition for TAMP_BKP12R register  ***************/
#define TAMP_BKP12R_Pos              (0U)
#define TAMP_BKP12R_Msk              (0xFFFFFFFFUL << TAMP_BKP12R_Pos)                  /*!< 0xFFFFFFFFU */
#define TAMP_BKP12R                  TAMP_BKP12R_Msk

/********************  Bits definition for TAMP_BKP13R register  ***************/
#define TAMP_BKP13R_Pos              (0U)
#define TAMP_BKP13R_Msk              (0xFFFFFFFFUL << TAMP_BKP13R_Pos)                 /*!< 0xFFFFFFFFU */
#define TAMP_BKP13R                  TAMP_BKP13R_Msk

