STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231cxx_ca35.h
/*******************  Bit definition for USART_ICR register  ******************/
#define USART_ICR_PECF_Pos             (0U)
#define USART_ICR_PECF_Msk             (0x1UL << USART_ICR_PECF_Pos)/*!< 0x00000001 */
#define USART_ICR_PECF                 USART_ICR_PECF_Msk          /*!< Parity error clear flag */
#define USART_ICR_FECF_Pos             (1U)
#define USART_ICR_FECF_Msk             (0x1UL << USART_ICR_FECF_Pos)/*!< 0x00000002 */
#define USART_ICR_FECF                 USART_ICR_FECF_Msk          /*!< Framing error clear flag */
#define USART_ICR_NECF_Pos             (2U)
#define USART_ICR_NECF_Msk             (0x1UL << USART_ICR_NECF_Pos)/*!< 0x00000004 */
#define USART_ICR_NECF                 USART_ICR_NECF_Msk          /*!< Noise detected clear flag */
#define USART_ICR_ORECF_Pos            (3U)
#define USART_ICR_ORECF_Msk            (0x1UL << USART_ICR_ORECF_Pos) /*!< 0x00000008 */
#define USART_ICR_ORECF                USART_ICR_ORECF_Msk         /*!< Overrun error clear flag */
#define USART_ICR_IDLECF_Pos           (4U)
#define USART_ICR_IDLECF_Msk           (0x1UL << USART_ICR_IDLECF_Pos)  /*!< 0x00000010 */
#define USART_ICR_IDLECF               USART_ICR_IDLECF_Msk        /*!< Idle line detected clear flag */
#define USART_ICR_TXFECF_Pos           (5U)
#define USART_ICR_TXFECF_Msk           (0x1UL << USART_ICR_TXFECF_Pos)  /*!< 0x00000020 */
#define USART_ICR_TXFECF               USART_ICR_TXFECF_Msk        /*!< TXFIFO empty clear flag */
#define USART_ICR_TCCF_Pos             (6U)
#define USART_ICR_TCCF_Msk             (0x1UL << USART_ICR_TCCF_Pos)/*!< 0x00000040 */
#define USART_ICR_TCCF                 USART_ICR_TCCF_Msk          /*!< Transmission complete clear flag */
#define USART_ICR_TCBGTCF_Pos          (7U)
#define USART_ICR_TCBGTCF_Msk          (0x1UL << USART_ICR_TCBGTCF_Pos)   /*!< 0x00000080 */
#define USART_ICR_TCBGTCF              USART_ICR_TCBGTCF_Msk       /*!< Transmission complete before Guard time clear flag */
#define USART_ICR_LBDCF_Pos            (8U)
#define USART_ICR_LBDCF_Msk            (0x1UL << USART_ICR_LBDCF_Pos) /*!< 0x00000100 */
#define USART_ICR_LBDCF                USART_ICR_LBDCF_Msk         /*!< LIN break detection clear flag */
#define USART_ICR_CTSCF_Pos            (9U)
#define USART_ICR_CTSCF_Msk            (0x1UL << USART_ICR_CTSCF_Pos) /*!< 0x00000200 */
#define USART_ICR_CTSCF                USART_ICR_CTSCF_Msk         /*!< CTS clear flag */
#define USART_ICR_RTOCF_Pos            (11U)
#define USART_ICR_RTOCF_Msk            (0x1UL << USART_ICR_RTOCF_Pos) /*!< 0x00000800 */
#define USART_ICR_RTOCF                USART_ICR_RTOCF_Msk         /*!< Receiver timeout clear flag */
#define USART_ICR_EOBCF_Pos            (12U)
#define USART_ICR_EOBCF_Msk            (0x1UL << USART_ICR_EOBCF_Pos) /*!< 0x00001000 */
#define USART_ICR_EOBCF                USART_ICR_EOBCF_Msk         /*!< End of block clear flag */
#define USART_ICR_UDRCF_Pos            (13U)
#define USART_ICR_UDRCF_Msk            (0x1UL << USART_ICR_UDRCF_Pos) /*!< 0x00002000 */
#define USART_ICR_UDRCF                USART_ICR_UDRCF_Msk         /*!< SPI slave underrun clear flag */
#define USART_ICR_CMCF_Pos             (17U)
#define USART_ICR_CMCF_Msk             (0x1UL << USART_ICR_CMCF_Pos)/*!< 0x00020000 */
#define USART_ICR_CMCF                 USART_ICR_CMCF_Msk          /*!< Character match clear flag */

/*******************  Bit definition for USART_RDR register  ******************/
#define USART_RDR_RDR_Pos              (0U)
#define USART_RDR_RDR_Msk              (0x1FFUL << USART_RDR_RDR_Pos) /*!< 0x000001FF */
#define USART_RDR_RDR                  USART_RDR_RDR_Msk           /*!< Receive data value */

/*******************  Bit definition for USART_TDR register  ******************/
#define USART_TDR_TDR_Pos              (0U)
#define USART_TDR_TDR_Msk              (0x1FFUL << USART_TDR_TDR_Pos) /*!< 0x000001FF */
#define USART_TDR_TDR                  USART_TDR_TDR_Msk           /*!< Transmit data value */

/*******************  Bit definition for USART_PRESC register  ****************/
#define USART_PRESC_PRESCALER_Pos      (0U)
#define USART_PRESC_PRESCALER_Msk      (0xFUL << USART_PRESC_PRESCALER_Pos)       /*!< 0x0000000F */
#define USART_PRESC_PRESCALER          USART_PRESC_PRESCALER_Msk   /*!< Clock prescaler */
#define USART_PRESC_PRESCALER_0        (0x1UL << USART_PRESC_PRESCALER_Pos)       /*!< 0x00000001 */
#define USART_PRESC_PRESCALER_1        (0x2UL << USART_PRESC_PRESCALER_Pos)       /*!< 0x00000002 */
#define USART_PRESC_PRESCALER_2        (0x4UL << USART_PRESC_PRESCALER_Pos)       /*!< 0x00000004 */
#define USART_PRESC_PRESCALER_3        (0x8UL << USART_PRESC_PRESCALER_Pos)       /*!< 0x00000008 */

/*******************  Bit definition for USART_AUTOCR register  ***************/
#define USART_AUTOCR_TDN_Pos           (0U)
#define USART_AUTOCR_TDN_Msk           (0xFFFFUL << USART_AUTOCR_TDN_Pos)     /*!< 0x0000FFFF */
#define USART_AUTOCR_TDN               USART_AUTOCR_TDN_Msk        /*!< TDN transmission data number */
#define USART_AUTOCR_TRIGPOL_Pos       (16U)
#define USART_AUTOCR_TRIGPOL_Msk       (0x1UL << USART_AUTOCR_TRIGPOL_Pos)      /*!< 0x00010000 */
#define USART_AUTOCR_TRIGPOL           USART_AUTOCR_TRIGPOL_Msk    /*!< Trigger polarity bit */
#define USART_AUTOCR_TRIGEN_Pos        (17U)
#define USART_AUTOCR_TRIGEN_Msk        (0x1UL << USART_AUTOCR_TRIGEN_Pos)     /*!< 0x00020000 */
#define USART_AUTOCR_TRIGEN            USART_AUTOCR_TRIGEN_Msk     /*!< Trigger enable bit  */
#define USART_AUTOCR_IDLEDIS_Pos       (18U)
#define USART_AUTOCR_IDLEDIS_Msk       (0x1UL << USART_AUTOCR_IDLEDIS_Pos)      /*!< 0x00040000 */
#define USART_AUTOCR_IDLEDIS           USART_AUTOCR_IDLEDIS_Msk    /*!< Idle frame transmission disable bit after enabling the transmitter */
#define USART_AUTOCR_TRIGSEL_Pos       (19U)
#define USART_AUTOCR_TRIGSEL_Msk       (0xFUL << USART_AUTOCR_TRIGSEL_Pos)      /*!< 0x00780000 */
#define USART_AUTOCR_TRIGSEL           USART_AUTOCR_TRIGSEL_Msk    /*!< Trigger selection bits  */

